print("a b c")
for a in range(2):
    for b in range(2):
        for c in range(2):
            if (a and (not c)) or ((not b) and (not c)) == 1:
                print(a, b, c)
# из моей таблицы можно легко понять, что последняя строчка это 4 строчка из задания, тк там две единицы
# из этого можно догадаться, что над нулем будет буква с
# так же моя 3 строчка с двумя нолями такая же как 2 строчка из задания, отсюда можно понять, что
# над единицей будет буква а, остается буква b, которая должна стоять посередине, ответ cba